{
  "title": "The Bidens make an island escape ahead of consequential 2024 announcement",
  "link": "the-bidens-make-an-island-escape-ahead-of-consequential.html",
  "author": {
    "id": "tXeY2N",
    "name": "Warren Wong",
    "avatar": "img/user/author-85z9UC.jpg"
  },
  "category": "Politics",
  "tags": [
    "biden",
    "usa"
  ],
  "image": false,
  "hidden": false,
  "blocks": [
    {
      "id": "dblUd0TQp8",
      "type": "paragraph",
      "data": {
        "text": "President Joe Biden this week returns to St. Croix, one of his and first lady Jill Biden’s beloved vacation spots, seeking a final opportunity for rest before what is expected to be a contentious 2023 and reelection run."
      }
    },
    {
      "id": "Mxf-xaZQmc",
      "type": "paragraph",
      "data": {
        "text": "As Biden unwinds in a familiar spot – the first couple have visited the US Virgin Islands for more than a dozen years, vacationing there approximately ten times since the mid-2000s – the work on his path forward intensifies back in a frigid Washington, DC. Advisers are already preparing the president’s annual State of the Union address, typically delivered in late January or early February, viewing the speech as an opportunity to lay down the stakes and themes that Biden could adopt on the campaign trail."
      }
    },
    {
      "id": "m2IAFBXfIJ",
      "type": "paragraph",
      "data": {
        "text": "The first couple arrived in St. Croix on Tuesday, along with family members, a gathering of the tight-knit clan who, according to several people with knowledge of recent conversations who have spoken to CNN, have now pledged support for another White House run by Biden. Senior administration officials once viewed this week’s tropical escape as a crucial juncture that would play a major part in deciding his political future, and – while the president does still plan to mull with his family the pros and cons of mounting a reelection bid – people who have discussed the matter with him lately say the decision is essentially made."
      }
    },
    {
      "id": "cqO75iyf9I",
      "type": "youtubeEmbed",
      "data": {
        "url": "https://www.youtube.com/watch?v=n1V1GPndCMU",
        "id": "n1V1GPndCMU"
      }
    },
    {
      "id": "Lct5C4saBK",
      "type": "header",
      "data": {
        "text": "Privacy, please",
        "level": 4
      }
    },
    {
      "id": "R2CSXs1ybo",
      "type": "paragraph",
      "data": {
        "text": "In 2014, Joe and Jill Biden enjoyed their time on the island so much, they visited St. Croix twice – once to ring in the new year and again for a weekend in March, a quick getaway trip not on the then-vice president’s official schedule."
      }
    },
    {
      "id": "ubHBWjBO-7",
      "type": "paragraph",
      "data": {
        "text": "In 2015, the couple again passed the week after Christmas there, after deciding he would not run for the White House."
      }
    },
    {
      "id": "ZkL88L0c6-",
      "type": "paragraph",
      "data": {
        "text": "In 2016, Bidens spent the waning days of his vice presidency relaxing on St. Croix, ahead of Donald Trump’s ascension to the White House."
      }
    }
  ],
  "dateCreated": "December 29, 2022",
  "dateModified": "May 10, 2023",
  "timeCreated": "03:56 PM",
  "timeModified": "10:24 AM"
}